PumkTbt/PIC16F887_LED_CONTROL3RESG/file code/PIC16F887_LED_CONTROL3RESG.X/PIC16F887_LED_CONTROL3RESG.c

// PIC16F887 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = ON       // RE3/MCLR pin function select bit (RE3/MCLR pin function is MCLR)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = OFF      // Brown Out Reset Selection bits (BOR disabled)
#pragma config IESO = OFF       // Internal External Switchover bit (Internal/External Switchover mode is disabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is disabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)

// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.
#include <xc.h>
#define _XTAL_FREQ 4000000	 
void chop(){   
        TRISE = 0;
        PORTE = 0x06;
        TRISB3 = 0;
        TRISB4 = 0;
        TRISB5 = 1;
        PORTB = 0x10;
        TRISB3 = 0;
        TRISB4 = 1;
        TRISB5 = 0;
        PORTB = 0x20;
        __delay_ms(200);
        TRISB = 0x01;
        PORTB = 0;
        PORTE = 0;
        __delay_ms(200);
}
void sangdan(){
    
}
void interrupt isr(void)
{
     if(INTF = 1){
    __delay_ms(5);
    sangdan();
     }
      INTF = 0;
}
void main(void) {
    ANSEL = 0;
    ANSELH = 0;
    TRISB0 = 1;
    nRBPU = 0;
    WPUB = 0x01;
    INTEDG = 1;
    INTF = 0;
    INTE = 1;
    GIE = 1;  
    while(1)
    {   chop();
    }
}
